In [89]:
%pip install ipython
%pip install seaborn

Requirement already satisfied: ipython in c:\users\bniet\anaconda3\lib\site-packages (8.2.0)
Requirement already satisfied: decorator in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (2.11.2)
Requirement already satisfied: stack-data in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.2.0)
Requirement already satisfied: backcall in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (61.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (3.0.20)
Requirement already satisfied: colorama in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.4.4)
Requirement already satisfied: traitlets>=5 in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\bniet\anaconda3\lib\site-packages (from ipython) (0.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\bniet\anaconda3\lib\site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\bniet\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Requirement already satisfied: executing in c:\users\bniet\anaconda3\lib\site-packages (from stack-data->ipython) (0.8.3)
Requirement already satisfied: asttokens in c:\users\bniet\anaconda3\lib\site-packages (from stack-data->ipython) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\bniet\anaconda3\lib\site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: six in c:\users\bniet\anaconda3\lib\site-packages (from asttokens->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\bniet\anaconda3\lib\site-packages (0.11.2)
Requirement already satisfied: matplotlib>=2.2 in c:\users\bniet\anaconda3\lib\site-packages (from seaborn) (3.5.1)
Requirement already satisfied: numpy>=1.15 in c:\users\bniet\anaconda3\lib\site-packages (from seaborn) (1.21.5)
Requirement already satisfied: scipy>=1.0 in c:\users\bniet\anaconda3\lib\site-packages (from seaborn) (1.7.3)
Requirement already satisfied: pandas>=0.23 in c:\users\bniet\anaconda3\lib\site-packages (from seaborn) (1.4.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (9.0.1)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.2)
Requirement already satisfied: cycler>=0.10 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: packaging>=20.0 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\bniet\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bniet\anaconda3\lib\site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\bniet\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [90]:
import pandas as pd

import numpy as np

import warnings
warnings.filterwarnings('ignore')

# para pintar
import pylab as plt
import seaborn as sns

# para que salga el grafico
%matplotlib inline

### Tabla actors

In [92]:
data_actor = pd.read_csv('../data/actor.csv', encoding = 'latin1')

In [93]:
data_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [94]:
# Duplicados

data_actor[data_actor.duplicated(keep=False)]

Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

In [95]:
# Borrar columna last_update del fichero actor.

data_actor.drop(['last_update'], axis=1, inplace = True)

In [96]:
data_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [97]:
# Agrupar columnas Name y Last name

data_actor['full_name'] = data_actor.first_name + ' ' + data_actor.last_name
data_actor.head()

   actor_id first_name     last_name            full_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [98]:
data_actor.to_csv('actor_clean.csv', index=True)

### Tabla category

In [100]:
data_category = pd.read_csv('../data/category.csv', encoding = 'latin1')

In [101]:
data_category.drop(['last_update'], axis=1, inplace = True)

In [102]:
data_category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [158]:
data_category.to_csv('category_clean.csv', index=False)

### Tabla film

In [160]:
data_film = pd.read_csv('../data/film.csv', encoding = 'latin1')

In [161]:
data_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [162]:
# Borrar columna original_language_id del fichero film, por valores nulos.

data_film.drop(['original_language_id'], axis=1, inplace = True)

In [163]:
data_film.drop(['last_update'], axis=1, inplace = True)

In [164]:
data_film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [165]:
data_film.to_csv('film_clean.csv', index=False)

### Tabla language

In [167]:
data_language = pd.read_csv('../data/language.csv', encoding = 'latin1')

In [168]:
data_language.drop(['last_update'], axis=1, inplace = True)

In [169]:
data_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [170]:
data_language.to_csv('language_clean.csv', index=False)

### Tabla old_HDD

In [172]:
data_old = pd.read_csv('../data/old_HDD.csv', encoding = 'latin1')

In [173]:
data_old['full_name'] = data_old.first_name + ' ' + data_old.last_name

In [174]:
data_old.head()

,first_name,last_name,title,release_year,category_id,full_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

In [175]:
data_old.to_csv('old_clean.csv', index=False)

### Fichero rental

In [177]:
data_rental = pd.read_csv('../data/rental.csv', encoding = 'latin1')

In [178]:
data_rental.drop(['last_update'], axis=1, inplace = True)

In [179]:
data_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [180]:
data_rental.to_csv('rental_clean.csv', index=False)

### Fichero inventory

In [182]:
data_inventory = pd.read_csv('../data/inventory.csv', encoding = 'latin1')

In [183]:
data_inventory.drop(['last_update'], axis=1, inplace = True)

In [184]:
data_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [185]:
data_inventory.to_csv('inventory_clean.csv', index=False)

### Subir datos a las tablas

In [186]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\bniet\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\bniet\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [187]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\bniet\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [188]:
from sqlalchemy import create_engine

In [196]:
# lenguaje+driver://usuario:password@servidor:puerto/database   (string de conexion)

film_industry='mysql+pymysql://root:1234@localhost:3306/film_industry'

cursor=create_engine(film_industry)

In [197]:
inventory_clean=pd.read_csv('inventory_clean.csv')

inventory_clean.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1000

In [191]:
film_clean=pd.read_csv('film_clean.csv')

film_clean.to_sql(name='film', con=cursor, if_exists='replace', index=False)

1000

In [192]:
old_clean=pd.read_csv('old_clean.csv')

old_clean.to_sql(name='old_hdd', con=cursor, if_exists='replace', index=False)

1000

In [193]:
actor_clean=pd.read_csv('actor_clean.csv')

actor_clean.drop(columns=['Unnamed: 0'], inplace=True)

actor_clean.to_sql(name='actors', con=cursor, if_exists='replace', index=False)

200

In [194]:
language_clean=pd.read_csv('language_clean.csv')

language_clean.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6

In [195]:
category_clean=pd.read_csv('category_clean.csv')

category_clean.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [198]:
rental_clean=pd.read_csv('rental_clean.csv')

rental_clean.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000